## Sqlite + Python: create simple database using jupyter notebook

In [11]:
# import libraries
import pandas as pd

# to create database
import sqlite3 as db

In [12]:
# create a dataframe

df = pd.DataFrame({'name': ['Anna', 'Bill', 'Carl', 'Dig'],
                   'age': [5, 10, 15, 20],
                   'weight': [30.3, 49.2, 59.4, 70.8]})

# read dataframe
df

   name  age  weight
0  Anna    5    30.3
1  Bill   10    49.2
2  Carl   15    59.4
3   Dig   20    70.8

### Sqlite connect to database

> No database

In [13]:
# connection will create a database

connection = db.connect('sqlp1.db')

# existing database will create a connection

In [14]:
# apply _sql from pandas to add data to database
# df.to_sql('table_name', connection_name) to create a table in database to run queries

df.to_sql('table1', connection)

4

In [15]:
# load sql to ipython

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
# refer to the database

%sql sqlite:///sqlp1.db

'Connected: @sqlp1.db'

In [17]:
%%sql

SELECT * FROM table1;

 * sqlite:///sqlp1.db
Done.

[(0, 'Anna', 5, 30.3),
 (1, 'Bill', 10, 49.2),
 (2, 'Carl', 15, 59.4),
 (3, 'Dig', 20, 70.8)]